# Assignment #7
## Movie Ratings

## Step #1
### Load pandas and import csv data

In [57]:
import pandas as pd 
df = pd.read_csv('Data.csv')
df

       User  Avengers Endgame  Green Book  The Dark Night  Memento  Avatar
0      Mike                 5           4             5.0      2.0     2.0
1      Jake                 3           5             4.0      4.0     NaN
2   Jordana                 2           5             3.0      4.0     5.0
3  Beatrice                 1           5             NaN      5.0     4.0
4     Jacky                 5           2             4.0      NaN     3.0

## Step #2
### Display average movie rating

In [58]:
df.mean()

Avengers Endgame    3.20
Green Book          4.20
The Dark Night      4.00
Memento             3.75
Avatar              3.50
dtype: float64

## Step #3 
### Display User average

In [59]:
user_df = df.copy()
user_df['mean'] = user_df.mean(axis=1)
user_df

,User,Avengers Endgame,Green Book,The Dark Night,Memento,Avatar,mean
0,Mike,5,4,5.0,2.0,2.0,3.60
1,Jake,3,5,4.0,4.0,NaN,4.00
2,Jordana,2,5,3.0,4.0,5.0,3.80
3,Beatrice,1,5,NaN,5.0,4.0,3.75
4,Jacky,5,2,4.0,NaN,3.0,3.50

## Step #4 
### Normalize the data

In [60]:
s0 = df.iloc[:,2:]
df.iloc[:,2:] = (s0 - s0.mean()) / (s0.max() - s0.min())
df

       User  Avengers Endgame  Green Book  The Dark Night   Memento    Avatar
0      Mike                 5   -0.066667             0.5 -0.583333 -0.500000
1      Jake                 3    0.266667             0.0  0.083333       NaN
2   Jordana                 2    0.266667            -0.5  0.083333  0.500000
3  Beatrice                 1    0.266667             NaN  0.416667  0.166667
4     Jacky                 5   -0.733333             0.0       NaN -0.166667

## Step #6
### Normalized mean

In [61]:
df.mean()

Avengers Endgame    3.200000e+00
Green Book         -4.440892e-17
The Dark Night      0.000000e+00
Memento             0.000000e+00
Avatar              0.000000e+00
dtype: float64

## Step #7
### Users normalized mean

In [62]:
user_df2 = df.copy()
user_df2['mean'] = user_df2.mean(axis=1)
user_df2

,User,Avengers Endgame,Green Book,The Dark Night,Memento,Avatar,mean
0,Mike,5,-0.066667,0.5,-0.583333,-0.500000,0.8700
1,Jake,3,0.266667,0.0,0.083333,NaN,0.8375
2,Jordana,2,0.266667,-0.5,0.083333,0.500000,0.4700
3,Beatrice,1,0.266667,NaN,0.416667,0.166667,0.4625
4,Jacky,5,-0.733333,0.0,NaN,-0.166667,1.0250

## Step #8
### Analyize the data
We can see that in this scenario Normalizing the data causes problems because there are Null values.